bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
//Root of Webserver/////////////////////////////////////////////////////

void Web_Server::handle_root()
{
    String path = "/index.html";
    String contentType =  getContentType(path);
    String pathWithGz = path + ".gz";
    //if have a index.html or gzip version this is default root page
    if((SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) && !_webserver->hasArg("forcefallback") && _webserver->arg("forcefallback")!="yes") {
        if(SPIFFS.exists(pathWithGz)) {
            path = pathWithGz;
        }
		File file = SPIFFS.open(path, FILE_READ);
        _webserver->streamFile(file, contentType);
        file.close();
        return;
    }
    //if no lets launch the default content
    _webserver->sendHeader("Content-Encoding", "gzip");
    _webserver->send_P(200,"text/html",PAGE_NOFILES,PAGE_NOFILES_SIZE);
}

//Handle not registred path on SPIFFS neither SD ///////////////////////
void Web_Server:: handle_not_found()
{
    if (is_authenticated() == LEVEL_GUEST) {
        _webserver->sendContent_P("HTTP/1.1 301 OK\r\nLocation: /\r\nCache-Control: no-cache\r\n\r\n");
        //_webserver->client().stop();
        return;
    }
    bool page_not_found = false;
    String path = _webserver->urlDecode(_webserver->uri());
    String contentType =  getContentType(path);
    String pathWithGz = path + ".gz";

#ifdef ENABLE_SD_CARD
    if ((path.substring(0,4) == "/SD/")) {
        //remove /SD
        path = path.substring(3);
        if(SD.exists((char *)pathWithGz.c_str()) || SD.exists((char *)path.c_str())) {
            if(SD.exists((char *)pathWithGz.c_str())) {
                path = pathWithGz;
            }
            File datafile = SD.open((char *)path.c_str());
            if (datafile) {
                vTaskDelay(1 / portTICK_RATE_MS);
                size_t totalFileSize = datafile.size();
                size_t i = 0;
                bool done = false;
                _webserver->setContentLength(totalFileSize);
                _webserver->send(200, contentType, "");
                uint8_t buf[1024];
                while (!done){
                    vTaskDelay(1 / portTICK_RATE_MS);
                    int v = datafile.read(buf,1024);
                    if ((v == -1) ||  (v == 0)) {
                        done = true;
                    } else {
                        _webserver->client().write(buf,1024);
                        i+=v;
                    }
                    if (i >= totalFileSize) done = true;
                }
                datafile.close();
                if ( i != totalFileSize) {
                     //error: TBD
                 }
                return; 
                }
        } 
        String content = "cannot find ";
        content+=path;
        _webserver->send(404,"text/plain",content.c_str());
        return;
    } else
#endif
        if(SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) {
            if(SPIFFS.exists(pathWithGz)) {
                path = pathWithGz;
            }
            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, contentType);
            file.close();
            return;
        } else {
            page_not_found = true;
        }

    if (page_not_found ) {
#ifdef ENABLE_CAPTIVE_PORTAL
        if (WiFi.getMode()!=WIFI_STA ) {
            String contentType= PAGE_CAPTIVE;
            String stmp = WiFi.softAPIP().toString();
            //Web address = ip + port
            String KEY_IP = "$WEB_ADDRESS$";
            String KEY_QUERY = "$QUERY$";
            if (_port != 80) {
                stmp+=":";
                stmp+=String(_port);
            }
            contentType.replace(KEY_IP,stmp);
            contentType.replace(KEY_IP,stmp);
            contentType.replace(KEY_QUERY,_webserver->uri());
            _webserver->send(200,"text/html",contentType);
            //_webserver->sendContent_P(NOT_AUTH_NF);
            //_webserver->client().stop();
            return;
        }
#endif
        path = "/404.htm";
        contentType =  getContentType(path);
        pathWithGz =  path + ".gz";
        if(SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) {
            if(SPIFFS.exists(pathWithGz)) {
                path = pathWithGz;
            }
            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, contentType);
            file.close();
           
        } else {
            //if not template use default page
            contentType = PAGE_404;
            String stmp;
            if (WiFi.getMode()==WIFI_STA ) {
                stmp=WiFi.localIP().toString();
            } else {
                stmp=WiFi.softAPIP().toString();
            }
            //Web address = ip + port
            String KEY_IP = "$WEB_ADDRESS$";
            String KEY_QUERY = "$QUERY$";
            if ( _port != 80) {
                stmp+=":";
                stmp+=String(_port);
            }
            contentType.replace(KEY_IP,stmp);
            contentType.replace(KEY_QUERY,_webserver->uri());
            _webserver->send(200,"text/html",contentType);
        }
    }
}

#ifdef ENABLE_SSDP
//http SSDP xml presentation
void Web_Server::handle_SSDP ()
{
    StreamString sschema ;
    if (sschema.reserve (1024) ) {
        String templ =  "<?xml version=\"1.0\"?>"
                        "<root xmlns=\"urn:schemas-upnp-org:device-1-0\">"
                        "<specVersion>"
                        "<major>1</major>"
                        "<minor>0</minor>"
                        "</specVersion>"
                        "<URLBase>http://%s:%u/</URLBase>"
                        "<device>"
                        "<deviceType>upnp:rootdevice</deviceType>"
                        "<friendlyName>%s</friendlyName>"
                        "<presentationURL>/</presentationURL>"
                        "<serialNumber>%s</serialNumber>"
                        "<modelName>ESP32</modelName>"
                        "<modelNumber>Marlin</modelNumber>"
                        "<modelURL>http://espressif.com/en/products/hardware/esp-wroom-32/overview</modelURL>"
                        "<manufacturer>Espressif Systems</manufacturer>"
                        "<manufacturerURL>http://espressif.com</manufacturerURL>"
                        "<UDN>uuid:%s</UDN>"
                        "</device>"
                        "</root>\r\n"
                        "\r\n";
        char uuid[37];
        String sip = WiFi.localIP().toString();
        uint32_t chipId = (uint16_t) (ESP.getEfuseMac() >> 32);
        sprintf (uuid, "38323636-4558-4dda-9188-cda0e6%02x%02x%02x",
                 (uint16_t) ( (chipId >> 16) & 0xff),
                 (uint16_t) ( (chipId >>  8) & 0xff),
                 (uint16_t)   chipId        & 0xff  );
        String serialNumber = String (chipId);
        sschema.printf (templ.c_str(),
                        sip.c_str(),
                        _port,
                        wifi_config.Hostname().c_str(),
                        serialNumber.c_str(),
                        uuid);
        _webserver->send (200, "text/xml", (String) sschema);
    } else {
        _webserver->send (500);
    }
}
#endif

bool Web_Server::is_realtime_cmd(char c){
    if (c == CMD_STATUS_REPORT) return true;
    if (c == CMD_CYCLE_START) return true;
    if (c == CMD_RESET) return true;
    if (c == CMD_FEED_HOLD) return true;
    if (c == CMD_SAFETY_DOOR) return true;
    if (c == CMD_JOG_CANCEL) return true;
    if (c == CMD_DEBUG_REPORT) return true;
    if (c == CMD_FEED_OVR_RESET) return true;
    if (c == CMD_FEED_OVR_COARSE_PLUS) return true;
    if (c == CMD_FEED_OVR_COARSE_MINUS) return true;
    if (c == CMD_FEED_OVR_FINE_PLUS) return true;
    if (c == CMD_FEED_OVR_FINE_MINUS) return true;
    if (c == CMD_RAPID_OVR_RESET) return true;
    if (c == CMD_RAPID_OVR_MEDIUM) return true;
    if (c == CMD_RAPID_OVR_LOW) return true;
    if (c == CMD_SPINDLE_OVR_COARSE_PLUS) return true;
    if (c == CMD_SPINDLE_OVR_COARSE_MINUS) return true;
    if (c == CMD_SPINDLE_OVR_FINE_PLUS) return true;
    if (c == CMD_SPINDLE_OVR_FINE_MINUS) return true;
    if (c == CMD_SPINDLE_OVR_STOP) return true;
    if (c == CMD_COOLANT_FLOOD_OVR_TOGGLE) return true;
    if (c == CMD_COOLANT_MIST_OVR_TOGGLE) return true;
    return false;
}

