bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
//Handle web command query and send answer//////////////////////////////
void Web_Server::handle_web_command ()
{
    //to save time if already disconnected
    //if (_webserver->hasArg ("PAGEID") ) {
    //    if (_webserver->arg ("PAGEID").length() > 0 ) {
    //       if (_webserver->arg ("PAGEID").toInt() != _id_connection) {
    //       _webserver->send (200, "text/plain", "Invalid command");
    //       return;
    //       }
    //    }
    //}
    level_authenticate_type auth_level = is_authenticated();
    String cmd = "";
    if (_webserver->hasArg ("plain") || _webserver->hasArg ("commandText") ) {
        if (_webserver->hasArg ("plain") ) {
            cmd = _webserver->arg ("plain");
        } else {
            cmd = _webserver->arg ("commandText");
        }
    } else {
        _webserver->send (200, "text/plain", "Invalid command");
        return;
    }
    //if it is internal command [ESPXXX]<parameter>
    cmd.trim();
    int ESPpos = cmd.indexOf ("[ESP");
    if (ESPpos > -1) {
        //is there the second part?
        int ESPpos2 = cmd.indexOf ("]", ESPpos);
        if (ESPpos2 > -1) {
            //Split in command and parameters
            String cmd_part1 = cmd.substring (ESPpos + 4, ESPpos2);
            String cmd_part2 = "";
            //only [ESP800] is allowed login free if authentication is enabled
            if ( (auth_level == LEVEL_GUEST)  && (cmd_part1.toInt() != 800) ) {
                _webserver->send (401, "text/plain", "Authentication failed!\n");
                return;
            }
            //is there space for parameters?
            if (ESPpos2 < cmd.length() ) {
                cmd_part2 = cmd.substring (ESPpos2 + 1);
            }
            //if command is a valid number then execute command
            if (cmd_part1.toInt() != 0) {
                ESPResponseStream espresponse(_webserver);
                //commmand is web only 
                COMMANDS::execute_internal_command (cmd_part1.toInt(), cmd_part2, auth_level, &espresponse);
                //flush
                espresponse.flush();
            }
            //if not is not a valid [ESPXXX] command
        }
    } else { //execute GCODE
        if (auth_level == LEVEL_GUEST) {
            _webserver->send (401, "text/plain", "Authentication failed!\n");
            return;
        }
        //Instead of send several commands one by one by web  / send full set and split here
        String scmd;
        String res = "";
        uint8_t sindex = 0;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        while ( scmd != "" ){
        if ((scmd.length() == 2) && (scmd[0] == 0xC2)){
              scmd[0]=scmd[1];
              scmd.remove(1,1);
            }  
        if (scmd.length() > 1)scmd += "\n";
        else if (!is_realtime_cmd(scmd[0]) )scmd += "\n";
        if (!Serial2Socket.push(scmd.c_str()))res = "Error";
        sindex++;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        }
        _webserver->send (200, "text/plain", res.c_str());
    }
}
//Handle web command query and send answer//////////////////////////////
void Web_Server::handle_web_command_silent ()
{
     //to save time if already disconnected
     //if (_webserver->hasArg ("PAGEID") ) {
     //   if (_webserver->arg ("PAGEID").length() > 0 ) {
     //      if (_webserver->arg ("PAGEID").toInt() != _id_connection) {
     //      _webserver->send (200, "text/plain", "Invalid command");
     //      return;
     //      }
     //   }
     //}
    level_authenticate_type auth_level = is_authenticated();
    String cmd = "";
    if (_webserver->hasArg ("plain") || _webserver->hasArg ("commandText") ) {
        if (_webserver->hasArg ("plain") ) {
            cmd = _webserver->arg ("plain");
        } else {
            cmd = _webserver->arg ("commandText");
        }
    } else {
        _webserver->send (200, "text/plain", "Invalid command");
        return;
    }
    //if it is internal command [ESPXXX]<parameter>
    cmd.trim();
    int ESPpos = cmd.indexOf ("[ESP");
    if (ESPpos > -1) {
        //is there the second part?
        int ESPpos2 = cmd.indexOf ("]", ESPpos);
        if (ESPpos2 > -1) {
            //Split in command and parameters
            String cmd_part1 = cmd.substring (ESPpos + 4, ESPpos2);
            String cmd_part2 = "";
            //only [ESP800] is allowed login free if authentication is enabled
            if ( (auth_level == LEVEL_GUEST)  && (cmd_part1.toInt() != 800) ) {
                _webserver->send (401, "text/plain", "Authentication failed!\n");
                return;
            }
            //is there space for parameters?
            if (ESPpos2 < cmd.length() ) {
                cmd_part2 = cmd.substring (ESPpos2 + 1);
            }
            //if command is a valid number then execute command
            if (cmd_part1.toInt() != 0) {
                //commmand is web only 
                if(COMMANDS::execute_internal_command (cmd_part1.toInt(), cmd_part2, auth_level, NULL)) _webserver->send (200, "text/plain", "ok");
                else  _webserver->send (200, "text/plain", "error");
            }
            //if not is not a valid [ESPXXX] command
        }
    } else { //execute GCODE
        if (auth_level == LEVEL_GUEST) {
            _webserver->send (401, "text/plain", "Authentication failed!\n");
            return;
        }
        //Instead of send several commands one by one by web  / send full set and split here
        String scmd;
        uint8_t sindex = 0;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        String res = "";
        while ( scmd != "" ){
        if (scmd.length() > 1)scmd+="\n";
        else if (!is_realtime_cmd(scmd[0]) )scmd+="\n";
        if (!Serial2Socket.push(scmd.c_str()))res = "Error";
        sindex++;
        scmd = get_Splited_Value(cmd,'\n', sindex);
        }
        _webserver->send (200, "text/plain", res.c_str());
    }
}


//login status check
void Web_Server::handle_login()
{
#ifdef ENABLE_AUTHENTICATION
    String smsg;
    String sUser,sPassword;
    String auths;
    int code = 200;
    bool msg_alert_error=false;
    //disconnect can be done anytime no need to check credential
    if (_webserver->hasArg("DISCONNECT")) {
        String cookie = _webserver->header("Cookie");
        int pos = cookie.indexOf("ESPSESSIONID=");
        String sessionID;
        if (pos!= -1) {
            int pos2 = cookie.indexOf(";",pos);
            sessionID = cookie.substring(pos+strlen("ESPSESSIONID="),pos2);
            }
        ClearAuthIP(_webserver->client().remoteIP(), sessionID.c_str());
        _webserver->sendHeader("Set-Cookie","ESPSESSIONID=0");
        _webserver->sendHeader("Cache-Control","no-cache");
        String buffer2send = "{\"status\":\"Ok\",\"authentication_lvl\":\"guest\"}";
        _webserver->send(code, "application/json", buffer2send);
        //_webserver->client().stop();
        return;
    }

    level_authenticate_type auth_level = is_authenticated();
   if (auth_level == LEVEL_GUEST) auths = "guest";
    else if (auth_level == LEVEL_USER) auths = "user";
    else if (auth_level == LEVEL_ADMIN) auths = "admin";
    else auths = "???";

