bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
    //check is it is a submission or a query
    if (_webserver->hasArg("SUBMIT")) {
        //is there a correct list of query?
        if ( _webserver->hasArg("PASSWORD") && _webserver->hasArg("USER")) {
            //USER
            sUser = _webserver->arg("USER");
            if ( !((sUser == DEFAULT_ADMIN_LOGIN) || (sUser == DEFAULT_USER_LOGIN))) {
                msg_alert_error=true;
                smsg = "Error : Incorrect User";
                code = 401;
            }
            if (msg_alert_error == false) {
                //Password
                sPassword = _webserver->arg("PASSWORD");
                String sadminPassword;

                Preferences prefs;
                prefs.begin(NAMESPACE, true);
                String defV = DEFAULT_ADMIN_PWD;
                sadminPassword = prefs.getString(ADMIN_PWD_ENTRY, defV);
                String suserPassword;
                defV = DEFAULT_USER_PWD;
                suserPassword = prefs.getString(USER_PWD_ENTRY, defV);
                prefs.end();

                if(!(((sUser == DEFAULT_ADMIN_LOGIN) && (strcmp(sPassword.c_str(),sadminPassword.c_str()) == 0)) ||
                        ((sUser == DEFAULT_USER_LOGIN) && (strcmp(sPassword.c_str(),suserPassword.c_str()) == 0)))) {
                    msg_alert_error=true;
                    smsg = "Error: Incorrect password";
                    code = 401;
                }
            }
        } else {
            msg_alert_error=true;
            smsg = "Error: Missing data";
            code = 500;
        }
        //change password
        if (_webserver->hasArg("PASSWORD") && _webserver->hasArg("USER") && _webserver->hasArg("NEWPASSWORD") && (msg_alert_error==false) ) {
            String newpassword =  _webserver->arg("NEWPASSWORD");
            if (COMMANDS::isLocalPasswordValid(newpassword.c_str())) {
                String spos;
                if(sUser == DEFAULT_ADMIN_LOGIN) spos = ADMIN_PWD_ENTRY;
                else spos = USER_PWD_ENTRY;
                
                Preferences prefs;
                prefs.begin(NAMESPACE, false);
                if (prefs.putString(spos.c_str(), newpassword) != newpassword.length()) {
                     msg_alert_error = true;
                     smsg = "Error: Cannot apply changes";
                     code = 500;
                }
                prefs.end();
            } else {
                msg_alert_error=true;
                smsg = "Error: Incorrect password";
                code = 500;
            }
        }
   if ((code == 200) || (code == 500)) {
      level_authenticate_type current_auth_level;
      if(sUser == DEFAULT_ADMIN_LOGIN) {
            current_auth_level = LEVEL_ADMIN;
        } else  if(sUser == DEFAULT_USER_LOGIN){
            current_auth_level = LEVEL_USER;
        } else {
            current_auth_level = LEVEL_GUEST;
        }
        //create Session
        if ((current_auth_level != auth_level) || (auth_level== LEVEL_GUEST)) {
            auth_ip * current_auth = new auth_ip;
            current_auth->level = current_auth_level;
            current_auth->ip=_webserver->client().remoteIP();
            strcpy(current_auth->sessionID,create_session_ID());
            strcpy(current_auth->userID,sUser.c_str());
            current_auth->last_time=millis();
            if (AddAuthIP(current_auth)) {
                String tmps ="ESPSESSIONID=";
                tmps+=current_auth->sessionID;
                _webserver->sendHeader("Set-Cookie",tmps);
                _webserver->sendHeader("Cache-Control","no-cache");
                switch(current_auth->level) {
                    case LEVEL_ADMIN:
                        auths = "admin";
                        break;
                     case LEVEL_USER:
                        auths = "user";
                        break;
                    default:
                        auths = "guest";
                        break;
                    }
            } else {
                delete current_auth;
                msg_alert_error=true;
                code = 500;
                smsg = "Error: Too many connections";
            }
        }
   }
    if (code == 200) smsg = "Ok";

    //build  JSON
    String buffer2send = "{\"status\":\"" + smsg + "\",\"authentication_lvl\":\"";
    buffer2send += auths;
    buffer2send += "\"}";
    _webserver->send(code, "application/json", buffer2send);
    } else {
    if (auth_level != LEVEL_GUEST) {
        String cookie = _webserver->header("Cookie");
        int pos = cookie.indexOf("ESPSESSIONID=");
        String sessionID;
        if (pos!= -1) {
            int pos2 = cookie.indexOf(";",pos);
            sessionID = cookie.substring(pos+strlen("ESPSESSIONID="),pos2);
            auth_ip * current_auth_info = GetAuth(_webserver->client().remoteIP(), sessionID.c_str());
            if (current_auth_info != NULL){
                    sUser = current_auth_info->userID;
                }
        }
    }
    String buffer2send = "{\"status\":\"200\",\"authentication_lvl\":\"";
    buffer2send += auths;
    buffer2send += "\",\"user\":\"";
    buffer2send += sUser;
    buffer2send +="\"}";
    _webserver->send(code, "application/json", buffer2send);
    }
#else
	_webserver->sendHeader("Cache-Control","no-cache");
    _webserver->send(200, "application/json", "{\"status\":\"Ok\",\"authentication_lvl\":\"admin\"}");
#endif
}
//SPIFFS
//SPIFFS files list and file commands
void Web_Server::handleFileList ()
{
    level_authenticate_type auth_level = is_authenticated();
    if (auth_level == LEVEL_GUEST) {
        _upload_status = UPLOAD_STATUS_NONE;
        _webserver->send (401, "text/plain", "Authentication failed!\n");
        return;
    }
    String path ;
    String status = "Ok";
    if ( (_upload_status == UPLOAD_STATUS_FAILED) || (_upload_status == UPLOAD_STATUS_CANCELLED) ) {
        status = "Upload failed";
    }
    //be sure root is correct according authentication
    if (auth_level == LEVEL_ADMIN) {
        path = "/";
    } else {
        path = "/user";
    }
    //get current path
    if (_webserver->hasArg ("path") ) {
        path += _webserver->arg ("path") ;
    }
    //to have a clean path
    path.trim();
    path.replace ("//", "/");
    if (path[path.length() - 1] != '/') {
        path += "/";
    }
    //check if query need some action
    if (_webserver->hasArg ("action") ) {
        //delete a file
        if (_webserver->arg ("action") == "delete" && _webserver->hasArg ("filename") ) {
            String filename;
            String shortname = _webserver->arg ("filename");
            shortname.replace ("/", "");
            filename = path + _webserver->arg ("filename");
            filename.replace ("//", "/");
            if (!SPIFFS.exists (filename) ) {
                status = shortname + " does not exists!";
            } else {
                if (SPIFFS.remove (filename) ) {
                    status = shortname + " deleted";
                    //what happen if no "/." and no other subfiles ?
                    String ptmp = path;
                    if ( (path != "/") && (path[path.length() - 1] = '/') ) {
                        ptmp = path.substring (0, path.length() - 1);
                    }
                    File dir = SPIFFS.open (ptmp);
                    File dircontent = dir.openNextFile();
                    if (!dircontent) {
                        //keep directory alive even empty
                        File r = SPIFFS.open (path + "/.", FILE_WRITE);
                        if (r) {
                            r.close();
                        }
                    }
                } else {
                    status = "Cannot deleted " ;
                    status += shortname ;
                }
            }
        }
        //delete a directory
        if (_webserver->arg ("action") == "deletedir" && _webserver->hasArg ("filename") ) {
            String filename;
            String shortname = _webserver->arg ("filename");
            shortname.replace ("/", "");
            filename = path + _webserver->arg ("filename");
            filename += "/";
            filename.replace ("//", "/");
            if (filename != "/") {
                bool delete_error = false;
                File dir = SPIFFS.open (path + shortname);
                {
                    File file2deleted = dir.openNextFile();
                    while (file2deleted) {
                        String fullpath = file2deleted.name();
                        if (!SPIFFS.remove (fullpath) ) {
                            delete_error = true;
                            status = "Cannot deleted " ;
                            status += fullpath;
                        }
                        file2deleted = dir.openNextFile();
                    }
                }
                if (!delete_error) {
                    status = shortname ;
                    status += " deleted";
                }
            }
        }
        //create a directory
        if (_webserver->arg ("action") == "createdir" && _webserver->hasArg ("filename") ) {
            String filename;
            filename = path + _webserver->arg ("filename") + "/.";
            String shortname = _webserver->arg ("filename");
            shortname.replace ("/", "");
            filename.replace ("//", "/");
            if (SPIFFS.exists (filename) ) {
                status = shortname + " already exists!";
            } else {
                File r = SPIFFS.open (filename, FILE_WRITE);
                if (!r) {
                    status = "Cannot create ";
                    status += shortname ;
                } else {
                    r.close();
                    status = shortname + " created";
                }
            }
        }
    }
    String jsonfile = "{";
    String ptmp = path;
    if ( (path != "/") && (path[path.length() - 1] = '/') ) {
        ptmp = path.substring (0, path.length() - 1);
    }
    File dir = SPIFFS.open (ptmp);
    jsonfile += "\"files\":[";
    bool firstentry = true;
    String subdirlist = "";
    File fileparsed = dir.openNextFile();
    while (fileparsed) {
        String filename = fileparsed.name();
        String size = "";
        bool addtolist = true;
        //remove path from name
        filename = filename.substring (path.length(), filename.length() );
        //check if file or subfile
        if (filename.indexOf ("/") > -1) {
            //Do not rely on "/." to define directory as SPIFFS upload won't create it but directly files
            //and no need to overload SPIFFS if not necessary to create "/." if no need
            //it will reduce SPIFFS available space so limit it to creation
            filename = filename.substring (0, filename.indexOf ("/") );
            String tag = "*";
            tag += filename + "*";
            if (subdirlist.indexOf (tag) > -1 || filename.length() == 0) { //already in list
                addtolist = false; //no need to add
            } else {
                size = "-1"; //it is subfile so display only directory, size will be -1 to describe it is directory
                if (subdirlist.length() == 0) {
                    subdirlist += "*";
                }
                subdirlist += filename + "*"; //add to list
            }
        } else {
            //do not add "." file
            if (! ( (filename == ".") || (filename == "") ) ) {
                size = ESPResponseStream::formatBytes (fileparsed.size() );
            } else {
                addtolist = false;
            }
        }
        if (addtolist) {
            if (!firstentry) {
                jsonfile += ",";
            } else {
                firstentry = false;
            }
            jsonfile += "{";
            jsonfile += "\"name\":\"";
            jsonfile += filename;
            jsonfile += "\",\"size\":\"";
            jsonfile += size;
            jsonfile += "\"";
            jsonfile += "}";
        }
        fileparsed = dir.openNextFile();
    }
    jsonfile += "],";
    jsonfile += "\"path\":\"" + path + "\",";
    jsonfile += "\"status\":\"" + status + "\",";
    size_t totalBytes;
    size_t usedBytes;
    totalBytes = SPIFFS.totalBytes();
    usedBytes = SPIFFS.usedBytes();
    jsonfile += "\"total\":\"" + ESPResponseStream::formatBytes (totalBytes) + "\",";
    jsonfile += "\"used\":\"" + ESPResponseStream::formatBytes (usedBytes) + "\",";
    jsonfile.concat (F ("\"occupation\":\"") );
    jsonfile += String (100 * usedBytes / totalBytes);
    jsonfile += "\"";
    jsonfile += "}";
    path = "";
    _webserver->sendHeader("Cache-Control", "no-cache");
    _webserver->send(200, "application/json", jsonfile);
    _upload_status = UPLOAD_STATUS_NONE;
}

//SPIFFS files uploader handle
void Web_Server::SPIFFSFileupload ()
{
     //get authentication status
    level_authenticate_type auth_level= is_authenticated();
    //Guest cannot upload - only admin
    if (auth_level == LEVEL_GUEST) {
        _upload_status = UPLOAD_STATUS_CANCELLED;
        grbl_send(CLIENT_ALL,"[MSG:Upload rejected]\r\n");
        _webserver->client().stop();
        return;
    }
    static String filename;
    static File fsUploadFile = (File)0;
    
    HTTPUpload& upload = _webserver->upload();
    //Upload start
    //**************
    if(upload.status == UPLOAD_FILE_START) {
        String upload_filename = upload.filename;
        if (upload_filename[0] != '/') filename = "/" + upload_filename;
        else filename = upload.filename;
        //according User or Admin the root is different as user is isolate to /user when admin has full access
        if(auth_level != LEVEL_ADMIN) {
            upload_filename = filename;
            filename = "/user" + upload_filename;
        }
        
