bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
        if (SPIFFS.exists (filename) ) {
            SPIFFS.remove (filename);
        }
        if (fsUploadFile ) {
            fsUploadFile.close();
        }
        //create file
        fsUploadFile = SPIFFS.open(filename, FILE_WRITE);
        //check If creation succeed
        if (fsUploadFile) {
            //if yes upload is started
            _upload_status= UPLOAD_STATUS_ONGOING;
        } else {
            //if no set cancel flag
            _upload_status=UPLOAD_STATUS_CANCELLED;
            grbl_send(CLIENT_ALL,"[MSG:Upload error]\r\n");
            _webserver->client().stop();
        }
        //Upload write
        //**************
    } else if(upload.status == UPLOAD_FILE_WRITE) {
        vTaskDelay(1 / portTICK_RATE_MS);
        //check if file is available and no error
        if(fsUploadFile && _upload_status == UPLOAD_STATUS_ONGOING) {
            //no error so write post date
            fsUploadFile.write(upload.buf, upload.currentSize);
        } else {
            //we have a problem set flag UPLOAD_STATUS_CANCELLED
            _upload_status=UPLOAD_STATUS_CANCELLED;
            fsUploadFile.close();
            if (SPIFFS.exists (filename) ) {
                SPIFFS.remove (filename);
            }
            _webserver->client().stop();
            grbl_send(CLIENT_ALL,"[MSG:Upload error]\r\n");
        }
        //Upload end
        //**************
    } else if(upload.status == UPLOAD_FILE_END) {
        //check if file is still open
        if(fsUploadFile) {
            //close it
            fsUploadFile.close();
            //check size 
            String  sizeargname  = upload.filename + "S";
            fsUploadFile = SPIFFS.open (filename, FILE_READ);
            uint32_t filesize = fsUploadFile.size();
            fsUploadFile.close();
            if (_webserver->hasArg (sizeargname.c_str()) ) {
                if (_webserver->arg (sizeargname.c_str()) != String(filesize)) {
                    _upload_status = UPLOAD_STATUS_FAILED;
                    SPIFFS.remove (filename);
                }
            } 
            if (_upload_status == UPLOAD_STATUS_ONGOING) {
                _upload_status = UPLOAD_STATUS_SUCCESSFUL;
            } else grbl_send(CLIENT_ALL,"[MSG:Upload error]\r\n");
        } else {
            //we have a problem set flag UPLOAD_STATUS_CANCELLED
            _upload_status=UPLOAD_STATUS_CANCELLED;
            _webserver->client().stop();
            if (SPIFFS.exists (filename) ) {
                SPIFFS.remove (filename);
                }
            grbl_send(CLIENT_ALL,"[MSG:Upload error]\r\n");
            
        }
        //Upload cancelled
        //**************
    } else {
            if (_upload_status == UPLOAD_STATUS_ONGOING) {
                _upload_status = UPLOAD_STATUS_CANCELLED;
            }
            if(fsUploadFile)fsUploadFile.close();
            if (SPIFFS.exists (filename) ) {
                SPIFFS.remove (filename);
            }
            grbl_send(CLIENT_ALL,"[MSG:Upload error]\r\n");
    }
    COMMANDS::wait(0);
}

//Web Update handler 
void Web_Server::handleUpdate ()
{
    level_authenticate_type auth_level = is_authenticated();
    if (auth_level != LEVEL_ADMIN) {
        _upload_status = UPLOAD_STATUS_NONE;
        _webserver->send (403, "text/plain", "Not allowed, log in first!\n");
        return;
    }
    String jsonfile = "{\"status\":\"" ;
    jsonfile += String(_upload_status);
    jsonfile += "\"}";
    //send status
    _webserver->sendHeader("Cache-Control", "no-cache");
    _webserver->send(200, "application/json", jsonfile);
    //if success restart
    if (_upload_status == UPLOAD_STATUS_SUCCESSFUL) {
        COMMANDS::wait(1000);
        COMMANDS::restart_ESP();
    } else {
        _upload_status = UPLOAD_STATUS_NONE;
    }
}

//File upload for Web update
void Web_Server::WebUpdateUpload ()
{
    static size_t last_upload_update;
    static uint32_t maxSketchSpace = 0;
    //only admin can update FW
    if (is_authenticated() != LEVEL_ADMIN) {
        _upload_status = UPLOAD_STATUS_CANCELLED;
       _webserver->client().stop();
        grbl_send(CLIENT_ALL,"[MSG:Upload rejected]\r\n");
        return;
    }
    
    //get current file ID
    HTTPUpload& upload = _webserver->upload();
    //Upload start
    //**************
    if(upload.status == UPLOAD_FILE_START) {
        grbl_send(CLIENT_ALL,"[MSG:Update Firmware]\r\n");
        _upload_status= UPLOAD_STATUS_ONGOING;
        String  sizeargname  = upload.filename + "S";
        if (_webserver->hasArg (sizeargname.c_str()) ) {
            maxSketchSpace = _webserver->arg (sizeargname).toInt();
        }
        last_upload_update = 0;
        if(!Update.begin()) { //start with max available size
            _upload_status=UPLOAD_STATUS_CANCELLED;
            grbl_send(CLIENT_ALL,"[MSG:Update cancelled]\r\n");
            _webserver->client().stop();
            return;
        } else {
            grbl_send(CLIENT_ALL,"\n[MSG:Update 0%]\r\n");
        }
        //Upload write
        //**************
    } else if(upload.status == UPLOAD_FILE_WRITE) {
        vTaskDelay(1 / portTICK_RATE_MS);
        //check if no error
        if (_upload_status == UPLOAD_STATUS_ONGOING) {
            //we do not know the total file size yet but we know the available space so let's use it
            if ( ((100 * upload.totalSize) / maxSketchSpace) !=last_upload_update) {
                if ( maxSketchSpace > 0)last_upload_update = (100 * upload.totalSize) / maxSketchSpace;
                else last_upload_update = upload.totalSize;
                String s = "Update ";
                s+= String(last_upload_update);
                s+="%";
                grbl_sendf(CLIENT_ALL,"[MSG:%s]\r\n", s.c_str());
            }
            if(Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                _upload_status=UPLOAD_STATUS_CANCELLED;
                grbl_send(CLIENT_ALL,"[MSG:Update write failed]\r\n");
            }
        }
        //Upload end
        //**************
    } else if(upload.status == UPLOAD_FILE_END) {
        if(Update.end(true)) { //true to set the size to the current progress
            //Now Reboot
            grbl_send(CLIENT_ALL,"[MSG:Update 100%]\r\n");
            _upload_status=UPLOAD_STATUS_SUCCESSFUL;
        } else grbl_send(CLIENT_ALL,"[MSG:Update failed]\r\n");
    } else if(upload.status == UPLOAD_FILE_ABORTED) {
        grbl_send(CLIENT_ALL,"[MSG:Update failed]\r\n");
        Update.end();
        _upload_status=UPLOAD_STATUS_CANCELLED;
    }
    COMMANDS::wait(0);
}


