bdring/Grbl_Esp32/Grbl_Esp32/web_server.cpp
#ifdef ENABLE_SD_CARD

//Function to delete not empty directory on SD card
bool  Web_Server::deleteRecursive(String path)
{
    bool result = true;
    File file = SD.open((char *)path.c_str());
    //failed
    if (!file) {
		return false;
	}
    if(!file.isDirectory()) {
        file.close();
        //return if success or not
        return SD.remove((char *)path.c_str());
    }
    file.rewindDirectory();
    while(true) {
        File entry = file.openNextFile();
        if (!entry) {
            break;
        }
        String entryPath = entry.name();
        if(entry.isDirectory()) {
            entry.close();
            if(!deleteRecursive(entryPath)) {
                result =  false;
            }
        } else {
            entry.close();
            if (!SD.remove((char *)entryPath.c_str())) {
                result = false;
                break;
            }
        }
       COMMANDS::wait(0); //wdtFeed
    }
    file.close();
    if (result) return SD.rmdir((char *)path.c_str());
    else return false;
}

//direct SD files list//////////////////////////////////////////////////
void Web_Server::handle_direct_SDFileList()
{
    //this is only for admin and user
    if (is_authenticated() == LEVEL_GUEST) {
        _upload_status=UPLOAD_STATUS_NONE;
        _webserver->send(401, "application/json", "{\"status\":\"Authentication failed!\"}");
        return;
    }

    String path="/";
    String sstatus="Ok";
    if ((_upload_status == UPLOAD_STATUS_FAILED) || (_upload_status == UPLOAD_STATUS_CANCELLED)) {
        sstatus = "Upload failed";
        _upload_status = UPLOAD_STATUS_NONE;
    }
    bool list_files = true;
    uint64_t totalspace = 0;
    uint64_t usedspace = 0;
    if (get_sd_state(true) != SDCARD_IDLE) {
        _webserver->sendHeader("Cache-Control","no-cache");
        _webserver->send(200, "application/json", "{\"status\":\"No SD Card\"}");
        return;
    }
    set_sd_state(SDCARD_BUSY_PARSING);
    //get current path
    if(_webserver->hasArg("path")) {
        path += _webserver->arg("path") ;
    }
    //to have a clean path
    path.trim();
    path.replace("//","/");
    if (path[path.length()-1] !='/') {
        path +="/";
    }
    //check if query need some action
    if(_webserver->hasArg("action")) {
        //delete a file
        if(_webserver->arg("action") == "delete" && _webserver->hasArg("filename")) {
            String filename;
            String shortname = _webserver->arg("filename");
            filename = path + shortname;
            shortname.replace("/","");
            filename.replace("//","/");
            if(!SD.exists((char *)filename.c_str())) {
                sstatus = shortname + " does not exist!";
            } else {
                if (SD.remove((char *)filename.c_str())) {
                    sstatus = shortname + " deleted";
                } else {
                    sstatus = "Cannot deleted " ;
                    sstatus+=shortname ;
                }
            }
        }
        //delete a directory
        if( _webserver->arg("action") == "deletedir" &&  _webserver->hasArg("filename")) {
            String filename;
            String shortname = _webserver->arg("filename");
            shortname.replace("/","");
            filename = path + "/" + shortname;
            filename.replace("//","/");
            if (filename != "/") {
                if(!SD.exists((char *)filename.c_str())) {
                    sstatus = shortname + " does not exist!";
                } else {
                    if (!deleteRecursive(filename)) {
                        sstatus ="Error deleting: ";
                        sstatus += shortname ;
                    } else {
                        sstatus = shortname ;
                        sstatus+=" deleted";
                    }
                }
            } else {
                sstatus ="Cannot delete root";
            }
        }
        //create a directory
        if( _webserver->arg("action")=="createdir" &&  _webserver->hasArg("filename")) {
            String filename;
            String shortname =  _webserver->arg("filename"); 
            filename = path + shortname;
            shortname.replace("/","");
            filename.replace("//","/");
            if(SD.exists((char *)filename.c_str())) {
                sstatus = shortname + " already exists!";
            } else {
                if (!SD.mkdir((char *)filename.c_str())) {
                    sstatus = "Cannot create ";
                    sstatus += shortname ;
                } else {
                    sstatus = shortname + " created";
                }
            }
        }
    }
    //check if no need build file list
    if( _webserver->hasArg("dontlist")) {
        if( _webserver->arg("dontlist") == "yes") {
            list_files = false;
        }
    }
    String jsonfile = "{" ;
    jsonfile+="\"files\":[";

    if (path!="/")path = path.substring(0,path.length()-1);
    if (path!="/" && !SD.exists((char *)path.c_str())) {

        String s =  "{\"status\":\" ";
        s += path;
        s+=  " does not exist on SD Card\"}";
         _webserver->send(200, "application/json", s.c_str());
        return;
    }
    if (list_files) {
        File dir = SD.open((char *)path.c_str());
        if (!dir) {
        }
        if(!dir.isDirectory()) {
            dir.close();
        }
        dir.rewindDirectory();
        File entry =  dir.openNextFile();
        int i = 0;
        while(entry) {
            COMMANDS::wait (1);
            if (i>0) {
                jsonfile+=",";
            }
            jsonfile+="{\"name\":\"";
            String tmpname = entry.name();
            int pos = tmpname.lastIndexOf("/");
            tmpname = tmpname.substring(pos+1);
            jsonfile+=tmpname;
            jsonfile+="\",\"shortname\":\""; //No need here
            jsonfile+=tmpname;
            jsonfile+="\",\"size\":\"";
            if (entry.isDirectory()) {
                jsonfile+="-1";
            } else {
                // files have sizes, directories do not
                jsonfile+=ESPResponseStream::formatBytes(entry.size());
            }
            jsonfile+="\",\"datetime\":\"";
            //TODO - can be done later
            jsonfile+="\"}";
            i++;
            entry.close();
            entry =  dir.openNextFile();
            }
        dir.close();
    }
    jsonfile+="],\"path\":\"";
    jsonfile+=path + "\",";
    static uint32_t volTotal = 1;
    static uint32_t volFree = 0;
    jsonfile+="\"total\":\"";
    String stotalspace,susedspace;
    //SDCard are in GB or MB but no less
    totalspace = SD.totalBytes();
    usedspace = SD.usedBytes();
    stotalspace = ESPResponseStream::formatBytes(totalspace);
    susedspace =  ESPResponseStream::formatBytes(usedspace);

    uint32_t  occupedspace = (volFree/volTotal)*100;
    //minimum if even one byte is used is 1%
    if ( (occupedspace <= 1) && (volTotal!=volFree)) {
        occupedspace=1;
    }
    if (totalspace) {
        jsonfile+=  stotalspace ;
    } else {
        jsonfile+=  "-1";
    }
    jsonfile+="\",\"used\":\"";
    jsonfile+=  susedspace ;
    jsonfile+="\",\"occupation\":\"";
    if (totalspace) {
        jsonfile+=  String(occupedspace);
    } else {
        jsonfile+=  "-1";
    }
    jsonfile+= "\",";
    jsonfile+= "\"mode\":\"direct\",";
    jsonfile+= "\"status\":\"";
    jsonfile+=sstatus + "\"";
    jsonfile+= "}";
    _webserver->sendHeader("Cache-Control","no-cache");
    _webserver->send (200, "application/json", jsonfile.c_str());
    _upload_status=UPLOAD_STATUS_NONE;
    set_sd_state(SDCARD_IDLE);
}

//SD File upload with direct access to SD///////////////////////////////
void Web_Server::SDFile_direct_upload()
{
    static String filename ;
    static File sdUploadFile;
    //this is only for admin and user
    if (is_authenticated() == LEVEL_GUEST) {
        _upload_status=UPLOAD_STATUS_NONE;
        _webserver->send(401, "application/json", "{\"status\":\"Authentication failed!\"}");
        return;
    }
    //retrieve current file id
    HTTPUpload& upload = _webserver->upload();
    //Upload start
    //**************
    if(upload.status == UPLOAD_FILE_START) {
        filename= upload.filename;
        //on SD need to add / if not present
        if (filename[0]!='/') {
            filename= "/"+upload.filename;
        }
        //check if SD Card is available
        if ( get_sd_state(true) != SDCARD_IDLE) {
            _upload_status=UPLOAD_STATUS_CANCELLED;
            grbl_send(CLIENT_ALL,"[MSG:Upload cancelled]\r\n");
            _webserver->client().stop();
            return;
        }
        set_sd_state(SDCARD_BUSY_UPLOADING);
        //delete file on SD Card if already present
        if(SD.exists((char *)filename.c_str())) {
            SD.remove((char *)filename.c_str());
        }
        //Create file for writing
        sdUploadFile = SD.open((char *)filename.c_str(), FILE_WRITE);
        //check if creation succeed
        if (!sdUploadFile) {
            //if creation failed
            _upload_status=UPLOAD_STATUS_FAILED;
            set_sd_state(SDCARD_IDLE);
            grbl_send(CLIENT_ALL,"[MSG:Upload failed]\r\n");
            _webserver->client().stop();
        }
        //if creation succeed set flag UPLOAD_STATUS_ONGOING
        else {
            _upload_status= UPLOAD_STATUS_ONGOING;
        }
        //Upload write
        //**************
    } else if(upload.status == UPLOAD_FILE_WRITE) {
        vTaskDelay(1 / portTICK_RATE_MS);
        if(sdUploadFile && (_upload_status == UPLOAD_STATUS_ONGOING) && (get_sd_state(false) == SDCARD_BUSY_UPLOADING)) {
            //no error write post data
            sdUploadFile.write(upload.buf, upload.currentSize);
        } else { //if error set flag UPLOAD_STATUS_FAILED
            _upload_status = UPLOAD_STATUS_FAILED;
            set_sd_state(SDCARD_IDLE);
            grbl_send(CLIENT_ALL,"[MSG:Upload failed]\r\n");
            _webserver->client().stop();
        }
        //Upload end
        //**************
    } else if(upload.status == UPLOAD_FILE_END) {
        //if file is open close it
        if(sdUploadFile) {
            sdUploadFile.close();
            //TODO Check size
            String  sizeargname  = upload.filename + "S";
            if (_webserver->hasArg (sizeargname.c_str()) ) {
                uint32_t filesize = 0;
                sdUploadFile = SD.open (filename.c_str(), FILE_READ);
                filesize = sdUploadFile.size();
                sdUploadFile.close();
                if (_webserver->arg (sizeargname.c_str()) != String(filesize)) {
                    _upload_status = UPLOAD_STATUS_FAILED;
                    SD.remove (filename.c_str());
                    }
            }
        } else {
            _upload_status = UPLOAD_STATUS_FAILED;
            set_sd_state(SDCARD_IDLE);
            grbl_send(CLIENT_ALL,"[MSG:Upload failed]\r\n");
        }
        if (_upload_status == UPLOAD_STATUS_ONGOING) {
            _upload_status = UPLOAD_STATUS_SUCCESSFUL;
        }
        set_sd_state(SDCARD_IDLE);
    } else {//Upload cancelled
        _upload_status=UPLOAD_STATUS_FAILED;
        set_sd_state(SDCARD_IDLE);
        grbl_send(CLIENT_ALL,"[MSG:Upload failed]\r\n");
        _webserver->client().stop();
        if(sdUploadFile) {
            sdUploadFile.close();
        }
    }
    COMMANDS::wait(0);
}
#endif

void Web_Server::handle(){
static uint32_t timeout = millis();
    COMMANDS::wait(0);
#ifdef ENABLE_CAPTIVE_PORTAL
    if(WiFi.getMode() != WIFI_STA){
        dnsServer.processNextRequest();
    }
#endif
    if (_webserver)_webserver->handleClient();
    if (_socket_server && _setupdone)_socket_server->loop();
    if ((millis() - timeout) > 10000) {
        if (_socket_server){
             String s = "PING:";
             s+=String(_id_connection);
            _socket_server->broadcastTXT(s);
            timeout=millis();
        }
    }
    
